tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
                if (should_skip_one_shot_power_off_for_slideshow()) {
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                ESP_LOGI(TAG,
                         "working_time timeout, evaluate CH583 power off elapsed=%lu target=%lu standby=%lu",
                         (unsigned long)elapsed,
                         (unsigned long)server_required_continue_work_time,
                         (unsigned long)wifi_standby_time_s);
                if (!configure_ch583_wake_timer_before_power_off()) {
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                UserLedStatus_SetPowerOffPending(true);
                vTaskDelay(pdMS_TO_TICKS(100));
                esp_err_t led_ret = UserLedStatus_PreparePowerOffSync();
                if (led_ret != ESP_OK) {
                    UserLedStatus_SetPowerOffPending(false);
                    ESP_LOGE(TAG, "power off postponed because LED shutdown failed ret=%s",
                             esp_err_to_name(led_ret));
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "LED shutdown failure left CH583 wake timer rollback pending");
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                vTaskDelay(pdMS_TO_TICKS(100));
                uint32_t final_ota_hold_flags = __atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE);
                bool final_epd_busy = ServerNetworkStaEpdDisplay_IsBusy();
                bool final_image_save_busy = ServerNetworkStaWifiWorkTime_IsImageSaveInProgress();
                TickType_t final_now = xTaskGetTickCount();
                uint32_t final_http_hold_remaining = http_activity_hold_remaining_seconds(final_now);
                uint32_t final_ch583_hold_remaining = ch583_activity_hold_remaining_seconds(final_now);
                uint32_t final_elapsed = update_working_time_seconds();
                bool final_timer_active = final_elapsed <= server_required_continue_work_time;
                if (final_timer_active ||
                    final_ota_hold_flags != 0 ||
                    final_epd_busy ||
                    final_image_save_busy ||
                    final_http_hold_remaining > 0 ||
                    final_ch583_hold_remaining > 0) {
                    ESP_LOGI(TAG,
                             "power off canceled by final guard timer=%d ota=0x%lx epd=%d image_save=%d http_remaining=%lu ch583_remaining=%lu",
                             final_timer_active ? 1 : 0,
                             (unsigned long)final_ota_hold_flags,
                             final_epd_busy ? 1 : 0,
                             final_image_save_busy ? 1 : 0,
                             (unsigned long)final_http_hold_remaining,
                             (unsigned long)final_ch583_hold_remaining);
                    if (final_http_hold_remaining > 0) {
                        (void)__atomic_fetch_or(&s_guard_log_flags,
                                                USER_WORK_STATE_GUARD_LOG_HTTP_BIT,
                                                __ATOMIC_ACQ_REL);
                    }
                    if (final_ch583_hold_remaining > 0) {
                        (void)__atomic_fetch_or(&s_guard_log_flags,
                                                USER_WORK_STATE_GUARD_LOG_CH583_BIT,
                                                __ATOMIC_ACQ_REL);
                    }
                    (void)__atomic_fetch_or(&s_runtime_state_flags,
                                            USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
                    if (!retry_pending_led_power_off_cancel()) {
                        ESP_LOGE(TAG, "final guard failed to release LED power-off lock, retry scheduled");
                    }
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "final guard failed to cancel CH583 wake timer, retry scheduled");
                    }
                    s_last_power_off_send_tick = 0;
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                esp_err_t spi_lock_ret =
                    TdxSharedSpi_Lock(pdMS_TO_TICKS(WORK_STATE_POWER_OFF_SPI_LOCK_TIMEOUT_MS));
                if (spi_lock_ret != ESP_OK) {
                    ESP_LOGE(TAG,
                             "power off postponed because shared SPI lock failed ret=%s",
                             esp_err_to_name(spi_lock_ret));
                    (void)__atomic_fetch_or(&s_runtime_state_flags,
                                            USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
                    if (!retry_pending_led_power_off_cancel()) {
                        ESP_LOGE(TAG, "SPI lock failure left LED power-off cancellation pending");
                    }
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "SPI lock failure left CH583 wake timer rollback pending");
                    }
                    s_last_power_off_send_tick = 0;
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }

                uint32_t locked_ota_hold_flags =
                    __atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE);
                bool locked_epd_busy = ServerNetworkStaEpdDisplay_IsBusy();
                bool locked_image_save_busy =
                    ServerNetworkStaWifiWorkTime_IsImageSaveInProgress();
                TickType_t locked_now = xTaskGetTickCount();
                uint32_t locked_http_hold_remaining =
                    http_activity_hold_remaining_seconds(locked_now);
                uint32_t locked_ch583_hold_remaining =
                    ch583_activity_hold_remaining_seconds(locked_now);
                uint32_t locked_elapsed = update_working_time_seconds();
                bool locked_timer_active =
                    locked_elapsed <= server_required_continue_work_time;
                if (locked_timer_active ||
                    locked_ota_hold_flags != 0 ||
                    locked_epd_busy ||
                    locked_image_save_busy ||
                    locked_http_hold_remaining > 0 ||
                    locked_ch583_hold_remaining > 0) {
                    ESP_LOGI(TAG,
                             "power off canceled by locked guard timer=%d ota=0x%lx epd=%d image_save=%d http_remaining=%lu ch583_remaining=%lu",
                             locked_timer_active ? 1 : 0,
                             (unsigned long)locked_ota_hold_flags,
                             locked_epd_busy ? 1 : 0,
                             locked_image_save_busy ? 1 : 0,
                             (unsigned long)locked_http_hold_remaining,
                             (unsigned long)locked_ch583_hold_remaining);
                    TdxSharedSpi_Unlock();
                    (void)__atomic_fetch_or(&s_runtime_state_flags,
                                            USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
                    if (!retry_pending_led_power_off_cancel()) {
                        ESP_LOGE(TAG, "locked guard failed to release LED power-off lock");
                    }
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "locked guard failed to cancel CH583 wake timer");
                    }
                    s_last_power_off_send_tick = 0;
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }

                int power_off_ret = ch583_wifi_uart_send_power_off();
                if (power_off_ret < 0) {
                    ESP_LOGW(TAG, "CH583 power off command failed ret=%d", power_off_ret);
                    TdxSharedSpi_Unlock();
                    (void)__atomic_fetch_or(&s_runtime_state_flags,
                                            USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
                    if (!retry_pending_led_power_off_cancel()) {
                        ESP_LOGE(TAG, "POWER_OFF failure left LED cancellation pending");
                    }
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "POWER_OFF failure left CH583 wake timer rollback pending");
                    }
                } else {
                    // The configured wake timer now belongs to the accepted power-off attempt.
                    (void)__atomic_fetch_and(&s_runtime_state_flags,
                                             ~USER_WORK_STATE_RUNTIME_WAKE_TIMER_CANCEL_PENDING_BIT,
                                             __ATOMIC_ACQ_REL);
                    esp_err_t power_ret = ServerNetworkStaEpdDisplay_SetPower(false);
                    if (power_ret != ESP_OK) {
                        ESP_LOGE(TAG,
                                 "POWER_OFF sent but EPD/SD power off failed ret=%s",
                                 esp_err_to_name(power_ret));
                    } else {
                        ESP_LOGI(TAG, "POWER_OFF sent and EPD/SD power switched off");
                    }

