tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
                    // Keep the shared bus locked after SD power loss. If CH583 does not
                    // cut ESP32-C5 power, restart so FATFS and the SD card are reinitialized.
                    vTaskDelay(pdMS_TO_TICKS(WORK_STATE_POWER_OFF_CUT_WAIT_MS));
                    ESP_LOGE(TAG, "CH583 did not cut power after POWER_OFF, restart");
                    esp_restart();
                }
            }
        } else {
            s_last_power_off_send_tick = 0;
            (void)__atomic_fetch_and(&s_guard_log_flags,
                                     ~(USER_WORK_STATE_GUARD_LOG_HTTP_BIT |
                                       USER_WORK_STATE_GUARD_LOG_CH583_BIT),
                                     __ATOMIC_ACQ_REL);
        }

        vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
    }
}

static const char *find_json_key(const char *body, const char *key)
{
    char pattern[64];
    const char *pos = body;
    if (body == NULL || key == NULL) {
        return NULL;
    }
    snprintf(pattern, sizeof(pattern), "\"%s\"", key);
    while ((pos = strstr(pos, pattern)) != NULL) {
        const char *after = pos + strlen(pattern);
        while (*after == ' ' || *after == '\t' || *after == '\r' || *after == '\n') {
            after++;
        }
        if (*after == ':') {
            return pos;
        }
        pos += strlen(pattern);
    }
    return NULL;
}

static bool json_func_equals(const char *body, const char *func)
{
    const char *pos = find_json_key(body, "func");
    if (pos == NULL || func == NULL) {
        return false;
    }

    pos += strlen("func") + 2;
    while (*pos == ' ' || *pos == '\t' || *pos == '\r' || *pos == '\n') {
        pos++;
    }
    if (*pos != ':') {
        return false;
    }
    pos++;
    while (*pos == ' ' || *pos == '\t' || *pos == '\r' || *pos == '\n') {
        pos++;
    }
    if (*pos != '"') {
        return false;
    }
    pos++;

    size_t func_len = strlen(func);
    return strncmp(pos, func, func_len) == 0 && pos[func_len] == '"';
}

static bool parse_json_int(const char *body, const char *key, int *out)
{
    const char *pos = find_json_key(body, key);
    char *end_ptr = NULL;
    long value = 0;
    if (pos == NULL || out == NULL) {
        return false;
    }

    pos += strlen(key) + 2;
    while (*pos == ' ' || *pos == '\t' || *pos == '\r' || *pos == '\n') {
        pos++;
    }
    if (*pos != ':') {
        return false;
    }
    pos++;
    while (*pos == ' ' || *pos == '\t' || *pos == '\r' || *pos == '\n') {
        pos++;
    }
    if ((*pos == '-' && (pos[1] < '0' || pos[1] > '9')) ||
        (*pos != '-' && (*pos < '0' || *pos > '9'))) {
        return false;
    }

    errno = 0;
    value = strtol(pos, &end_ptr, 10);
    if (errno != 0 || end_ptr == pos || value < INT32_MIN || value > INT32_MAX) {
        return false;
    }
    while (*end_ptr == ' ' || *end_ptr == '\t' || *end_ptr == '\r' || *end_ptr == '\n') {
        end_ptr++;
    }
    if (*end_ptr != ',' && *end_ptr != '}') {
        return false;
    }
    *out = (int)value;
    return true;
}

static esp_err_t send_wifi_work_time_result(httpd_req_t *req, int result, const char *message)
{
    char json[176];
    if (result == TDX_JSON_RESULT_OK) {
        snprintf(json, sizeof(json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d}",
                 TDX_JSON_RESULT_OK);
    } else {
        snprintf(json, sizeof(json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d,\"message\":\"%s\"}",
                 result,
                 message != NULL ? message : "set wifi work time failed");
    }

    ESP_LOGI(TAG, "set_wifi_work_time response: %s", json);
    httpd_resp_set_type(req, "application/json");
    return httpd_resp_sendstr(req, json);
}

void ServerNetworkStaWifiWorkTime_OnNetworkData(void)
{
    working_time = 0;
    s_last_network_data_tick = xTaskGetTickCount();
    s_wifi_work_start_tick = s_last_network_data_tick;
    s_last_power_off_send_tick = 0;
    if (server_required_continue_work_time > 0) {
        ESP_LOGI(TAG, "activity reset working_time continue=%lu elapsed_ms=%u",
                 (unsigned long)server_required_continue_work_time,
                 (unsigned int)((s_last_network_data_tick - s_wifi_work_start_tick) * portTICK_PERIOD_MS));
    }
}

void ServerNetworkStaWifiWorkTime_OnHttpNetworkActivity(void)
{
    TickType_t now = xTaskGetTickCount();
    uint32_t encoded_tick = (uint32_t)now + 1U;
    if (encoded_tick == 0) {
        encoded_tick = 1U;
    }
    __atomic_store_n(&s_last_http_activity_tick_encoded, encoded_tick, __ATOMIC_RELEASE);
    s_last_power_off_send_tick = 0;
}

void ServerNetworkStaWifiWorkTime_OnCh583Activity(void)
{
    TickType_t now = xTaskGetTickCount();
    uint32_t encoded_tick = (uint32_t)now + 1U;
    if (encoded_tick == 0) {
        encoded_tick = 1U;
    }
    __atomic_store_n(&s_last_ch583_activity_tick_encoded, encoded_tick, __ATOMIC_RELEASE);
    s_last_power_off_send_tick = 0;
}

void ServerNetworkStaWifiWorkTime_OnCh583Initialized(void)
{
    // Record the timed hold before releasing the startup guard so shutdown cannot race initialization.
    ServerNetworkStaWifiWorkTime_OnCh583Activity();
    uint32_t old_flags = __atomic_fetch_and(&s_runtime_state_flags,
                                            ~USER_WORK_STATE_RUNTIME_CH583_STARTUP_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
    if ((old_flags & USER_WORK_STATE_RUNTIME_CH583_STARTUP_PENDING_BIT) != 0) {
        ESP_LOGI(TAG, "CH583 startup guard released, activity hold started seconds=%u",
                 (unsigned int)USER_WORK_STATE_CH583_ACTIVITY_HOLD_SECONDS);
    }
}

void ServerNetworkStaWifiWorkTime_OnDeviceInfoPending(void)
{
    // Keep the work task out of shutdown preparation while a new mandatory
    // DEVICE_INFO attempt is being validated, persisted, and acknowledged.
    (void)__atomic_fetch_or(&s_runtime_state_flags,
                            USER_WORK_STATE_RUNTIME_DEVICE_INFO_PENDING_BIT,
                            __ATOMIC_ACQ_REL);
}

void ServerNetworkStaWifiWorkTime_OnDeviceInfoReady(void)
{
    // Start a fresh activity hold before releasing the mandatory handshake guard.
    ServerNetworkStaWifiWorkTime_OnCh583Activity();
    (void)__atomic_fetch_and(&s_runtime_state_flags,
                             ~USER_WORK_STATE_RUNTIME_DEVICE_INFO_PENDING_BIT,
                             __ATOMIC_ACQ_REL);
}

void ServerNetworkStaWifiWorkTime_RequestOneShotPowerOffCountdown(uint32_t seconds)
{
    if (seconds == 0) {
        return;
    }
    if (!s_one_shot_power_off_countdown_active) {
        s_one_shot_restore_continue_time = server_required_continue_work_time;
        s_one_shot_restore_standby_time = wifi_standby_time_s;
    }

    server_required_continue_work_time = seconds;
    wifi_standby_time_s = seconds;
    working_time = 0;
    s_wifi_work_start_tick = xTaskGetTickCount();
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;
    s_one_shot_power_off_countdown_active = true;
    UserLedStatus_SetPowerOffPending(true);

