tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
    ESP_LOGI(TAG,
             "one-shot power off countdown requested target=%lu standby=%lu",
             (unsigned long)server_required_continue_work_time,
             (unsigned long)wifi_standby_time_s);
}

void ServerNetworkStaWifiWorkTime_SetImageSaveInProgress(bool in_progress)
{
    bool old_value = __atomic_exchange_n(&s_image_save_in_progress, in_progress, __ATOMIC_ACQ_REL);
    if (old_value != in_progress) {
        ESP_LOGI(TAG, "image save in progress=%d", in_progress ? 1 : 0);
    }
}

bool ServerNetworkStaWifiWorkTime_IsImageSaveInProgress(void)
{
    return __atomic_load_n(&s_image_save_in_progress, __ATOMIC_ACQUIRE);
}

void ServerNetworkStaWifiWorkTime_SetOtaWriteInProgress(bool in_progress)
{
    if (in_progress) {
        (void)__atomic_fetch_or(&s_ota_hold_flags,
                                USER_WORK_STATE_OTA_HOLD_WRITE_BIT,
                                __ATOMIC_ACQ_REL);
    } else {
        (void)__atomic_fetch_and(&s_ota_hold_flags,
                                 ~USER_WORK_STATE_OTA_HOLD_WRITE_BIT,
                                 __ATOMIC_ACQ_REL);
    }
    ESP_LOGI(TAG, "ota write in progress=%d hold=0x%lx",
             in_progress ? 1 : 0,
             (unsigned long)__atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE));
}

void ServerNetworkStaWifiWorkTime_SetOtaReceiveInProgress(bool in_progress)
{
    if (in_progress) {
        (void)__atomic_fetch_or(&s_ota_hold_flags,
                                USER_WORK_STATE_OTA_HOLD_RECEIVE_BIT,
                                __ATOMIC_ACQ_REL);
    } else {
        (void)__atomic_fetch_and(&s_ota_hold_flags,
                                 ~USER_WORK_STATE_OTA_HOLD_RECEIVE_BIT,
                                 __ATOMIC_ACQ_REL);
    }
    ESP_LOGI(TAG, "ota receive in progress=%d hold=0x%lx",
             in_progress ? 1 : 0,
             (unsigned long)__atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE));
}

esp_err_t ServerNetworkStaWifiWorkTime_Init(void)
{
    user_work_state_nvs_blob_t blob = {0};
    size_t stored_size = 0;

    s_wifi_work_start_tick = xTaskGetTickCount();
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;
    uint32_t startup_guard_flags = USER_WORK_STATE_RUNTIME_CH583_STARTUP_PENDING_BIT;
#if USER_CH583_UART_ENABLE
    startup_guard_flags |= USER_WORK_STATE_RUNTIME_DEVICE_INFO_PENDING_BIT;
#endif
    (void)__atomic_fetch_or(&s_runtime_state_flags, startup_guard_flags, __ATOMIC_ACQ_REL);
#if USER_CH583_UART_ENABLE
    ESP_LOGI(TAG, "CH583 startup guard active until UART and DEVICE_INFO are ready");
#else
    ESP_LOGI(TAG, "CH583 startup guard active until UART initialization completes");
#endif

    esp_err_t ret = load_work_state_from_nvs(&blob, &stored_size);
    if (ret == ESP_OK) {
        log_work_state_blob("read value", &blob);
        apply_work_state_blob(&blob);
    } else {
        sleep_time = 0;
        working_time = 0;
        server_required_continue_work_time = USER_WORK_STATE_DEFAULT_CONTINUE_SECONDS;
        wifi_standby_time_s = USER_WORK_STATE_DEFAULT_STANDBY_SECONDS;
        ESP_LOGW(TAG, "use default work state ret=%s stored_size=%u continue=%lu standby=%lu",
                 esp_err_to_name(ret), (unsigned int)stored_size,
                 (unsigned long)server_required_continue_work_time,
                 (unsigned long)wifi_standby_time_s);
        ret = save_work_state_to_nvs();
    }

    load_work_time_vars_from_app_nvs();
    esp_err_t app_nvs_ret = save_work_time_vars_to_app_nvs();
    if (ret == ESP_OK && app_nvs_ret != ESP_OK) {
        ret = app_nvs_ret;
    }

    if (s_work_state_task == NULL) {
        BaseType_t task_ret = xTaskCreate(work_state_task,
                                          "work_state",
                                          USER_WORK_STATE_TASK_STACK_SIZE,
                                          NULL,
                                          USER_WORK_STATE_TASK_PRIORITY,
                                          &s_work_state_task);
        if (task_ret != pdPASS) {
            ESP_LOGE(TAG, "create work_state task failed");
            return ESP_ERR_NO_MEM;
        }
    }

    return ret;
}

esp_err_t ServerNetworkStaWifiWorkTime_SetAndSave(uint32_t seconds)
{
    if (s_work_state_task == NULL) {
        ESP_LOGE(TAG, "set work time apply failed because work_state task is not ready");
        return ESP_ERR_INVALID_STATE;
    }

    server_required_continue_work_time = clamp_continue_seconds(seconds);
    wifi_standby_time_s = seconds;
    working_time = 0;
    s_wifi_work_start_tick = xTaskGetTickCount();
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;
    s_one_shot_power_off_countdown_active = false;
    UserLedStatus_SetPowerOffPending(false);

    ESP_LOGI(TAG, "set work time requested=%lu continue=%lu standby=%lu",
             (unsigned long)seconds,
             (unsigned long)server_required_continue_work_time,
             (unsigned long)wifi_standby_time_s);
    esp_err_t ret = save_work_state_to_nvs();
    esp_err_t app_nvs_ret = save_work_time_vars_to_app_nvs();
    if (ret == ESP_OK && app_nvs_ret != ESP_OK) {
        ret = app_nvs_ret;
    }
    ESP_LOGI(TAG, "set work time save ret=%s app_nvs_ret=%s",
             esp_err_to_name(ret),
             esp_err_to_name(app_nvs_ret));
    return ret;
}

esp_err_t ServerNetworkStaWifiWorkTime_ProcessJson(httpd_req_t *req,
                                                   const char *body,
                                                   size_t body_len)
{
    (void)body_len;
    if (!json_func_equals(body, "set_wifi_work_time")) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    int seconds = 0;
    if (find_json_key(body, "time") != NULL) {
        ESP_LOGW(TAG, "set_wifi_work_time legacy time field is not supported body=%s",
                 body != NULL ? body : "<null>");
        return send_wifi_work_time_result(req,
                                          TDX_JSON_RESULT_PARAM_INVALID,
                                          "time field is not supported");
    }
    if (!parse_json_int(body, "seconds", &seconds)) {
        ESP_LOGW(TAG, "set_wifi_work_time invalid seconds body=%s", body != NULL ? body : "<null>");
        return send_wifi_work_time_result(req,
                                          TDX_JSON_RESULT_WIFI_WORK_TIME_MISSING,
                                          "set wifi work time failed");
    }
    if (seconds < SERVER_NETWORK_STA_WIFI_WORK_TIME_NETWORK_USB_MIN_SECONDS ||
        seconds > SERVER_NETWORK_STA_WIFI_WORK_TIME_MAX_SECONDS) {
        ESP_LOGW(TAG, "set_wifi_work_time seconds out of range seconds=%d body=%s",
                 seconds, body != NULL ? body : "<null>");
        return send_wifi_work_time_result(req,
                                          TDX_JSON_RESULT_WIFI_WORK_TIME_RANGE,
                                          "set wifi work time failed");
    }

    esp_err_t set_ret = ServerNetworkStaWifiWorkTime_SetAndSave((uint32_t)seconds);
    if (set_ret != ESP_OK) {
        ESP_LOGE(TAG, "set_wifi_work_time save failed: %s", esp_err_to_name(set_ret));
        return send_wifi_work_time_result(req,
                                          set_ret == ESP_ERR_INVALID_STATE ?
                                              TDX_JSON_RESULT_WIFI_WORK_TIME_APPLY_FAILED :
                                              TDX_JSON_RESULT_WIFI_WORK_TIME_SAVE_FAILED,
                                          "set wifi work time failed");
    }

    ESP_LOGI(TAG, "set_wifi_work_time updated seconds=%d max=%d working_time=%lu",
             seconds,
             SERVER_NETWORK_STA_WIFI_WORK_TIME_MAX_SECONDS,
             (unsigned long)update_working_time_seconds());
    ESP_LOGI(TAG, "set_wifi_work_time saved, CH583 power-off timeout is enabled");
    return send_wifi_work_time_result(req, TDX_JSON_RESULT_OK, NULL);
}
